app/views/users/index.html.erb

              <div class="content">
                投稿数：<%= user.recipes.count %>
---
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]