app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id
    @recipe.save
---
INSERT INTO "recipes" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "鶏もも肉の甘辛チキン　レシピ"], ["body", "パラメータは受け取る値に制限をかけているのです"], ["created_at", "2023-03-12 06:23:16.388785"], ["updated_at", "2023-03-12 06:23:16.388785"]]

  def update
    @recipe = Recipe.find(params[:id])
    # どのカラムをアップデートするのか許可する
    @recipe.update(recipe_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "recipes" SET "title" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "鶏もも肉の甘辛チキン　レシピ"], ["updated_at", "2023-03-10 15:42:08.743776"], ["id", 2]]

  def destroy
    recipe = Recipe.find(params[:id])
    recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 2]]