app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    # user_paramsは下で定義
    @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "uenosyuzi"], ["profile", ""], ["updated_at", "2023-03-03 15:53:31.637329"], ["id", 2]]